export default function Policy(){
    return(
        <div>
            <h2> 올클래스 개인정보처리방침 </h2>

            
            <h3>개인정보의 처리 목적</h3>
            <p>
            올클래스는 다음의 목적을 위하여 개인정보를 처리하고 있으며, 이외의 용도로는 이용하지 않습니다.

            (1) 고객 가입 의사 확인, 고객에 대한 서비스 제공에 따른 본인 식별 및 인증, 회원자격 유지 및 관리, 불량회원의 부정 이용 방지와 비인가 사용 방지 불만처리 등 민원처리, 고지사항 전달 등

            (2) 마케팅 및 광고에 활용 신규 서비스(제품) 개발 및 특화, 이벤트 등 광고성 정보 전달, 인구통계학적 특성에 따른 서비스 제공 및 광고 게재, 접속 빈도 파악 또는 회원의 서비스 이용에 대한 통계

            (3) 가입횟수 제한, 분쟁조정을 위한 기록보존, 회원의 각종 통계자료 산출

            (4) 물품 또는 서비스 제공에 관한 계약 이행 및 서비스 제공에 따른 요금 정산 및 콘텐츠 제공, 구매 및 요금 결제, 본인인증, 물품 또는 서비스의 공급/배송, 청구지 등 발송

            </p>
            <h3>개인정보처리 위탁</h3>

            <p>올클래스는 원활한 개인정보 업무처리를 위하여 다음과 같이 개인정보 처리업무를 위탁할 수 있습니다.

                (1)올클래스는 위탁계약 체결 시 개인정보 보호법 제25조에 따라 위탁업무 수행목적 외 개인정보 처리금지, 기술적/관리적 보호조치, 재위탁 제한, 수탁자에 대한 관리/감독, 손해배상 등 책임에 관한 사항을 계약서 등 문서에 명시하고, 수탁자가 개인정보를 안전하게 처리하는지를 감독합니다.

                (2) 위탁업무의 내용이나 수탁자가 변경될 경우에는 지체 없이 본 개인정보 처리방침을 통하여 공개합니다.</p>
            <h3>정보주체의 권리, 의무 및 그 행사방법</h3>
            <p>

이용자는 개인정보주체로서 올클래스에 대해 언제든지 다음 각 호의 개인정보 보호 관련 권리를 행사할 수 있습니다.

(1) 개인정보 열람요구

(2) 오류 등이 있을 경우 정정 요구

(3) 삭제요구

(4) 처리정지 요구

            </p>

<h3>처리하는 개인정보의 항목 작성</h3>
<p>
올클래스는 다음의 개인정보 항목을 처리하고 있습니다.

- 로그인 ID와 비밀번호, 이름, 닉네임, 핸드폰 번호 및 전화번호, 주소, 이메일 주소, 생년월일, 성별, 학교, 학년, 계열, 신용카드정보, 은행계좌정보, 결제기록, 접속 IP 정보, 쿠키, 서비스 이용 기록, 접속 로그,
- 학원 회원의 경우 대표자의 이름, 연락처, 이메일, 담당자의 이름, 직책, 연락처, 학원 설립 운영등록증과 학원 사업자 등록증
</p>

<h3>개인정보 수집방법</h3>

<p>
올클래스는 다음과 같은 방법들을 통해 개인정보를 수집합니다.

- 홈페이지 및 앱에서의 회원가입, 전화/팩스/면담 등을 통한 회원가입, 상담게시판, 공개 게시판, 서면양식, 경품 행사 응모, 배송 요청 등
</p>

<h3>
개인정보의 처리 및 보유기간
</h3>
<p>

개인정보의 처리 및 보유기간은 다음과 같습니다.

(1) 보유 항목 : 이름 , 생년월일 , 로그인ID , 비밀번호 , 자택 주소 , 휴대전화번호 , 이메일 , 결제기록

(처리항목과 같습니다.)

(2) 보유 근거 : 전자상거래 등에서의 소비자보호에 관한 법률

(이용약관 및 개인정보처리방침)

(3) 보유 기간 : 1년

(4) 회원탈퇴 이후 정보보관
회원탈퇴 후에도 관계법령의 규정에 의하여 보존이 필요한 회원 정보는 법령이 정한 기간 동안 보관합니다.

- 표시/광고에 관한 기록, 계약 또는 청약철회 등에 관한 기록, 대금결제 및 재화 등의 공급에 관한 기록, 소비자의 불만 또는 분쟁처리에 관한 기록 (전자상거래 등에서의 소비자보호에 관한 법률)
- 신용정보의 수집/처리 및 이용 등에 관한 기록 (신용정보의 이용 및 보호에 관한 법률)
- 통신 사실 확인 자료 (통신비밀보호법)
</p>
<h3>개인정보의 파기</h3>
<p>

올클래스는 개인정보의 보유 및 보관기간이 끝난 경우 지체 없이 해당 개인정보를 파기합니다.

(1) 파기절차: 이용자가 입력한 정보는 별도의 DB에 옮겨져(종이의 경우 별도의 서류) 내부 방침 및 기타 관련 법령에 따라 일정 기간 저장된 후 혹은 즉시 파기됩니다. 이때, DB로 옮겨진 개인정보는 법률에 의한 경우가 아니고서는 다른 목적으로 이용되지 않습니다.(개인정보 보호법 제 21조 제 1항)

개인정보 보호법 제 21조 제 4항 및 개인정보 보호법 시행령 제 16조 제 1항에 따라 전자적 파일의 형태인 경우에는 복원이 불가능한 방법으로 영구 삭제, 전자적 파일 형태 외의 기록물, 인쇄물, 서면, 그밖의 기록 매체인 경우는 파쇄 또는 소각하여 반드시 복구가 불가능하도록 확실하게 파기합니다.

(2) 파기기한: 이용자의 개인정보는 개인정보의 보유 및 보관 기간이 경과된 경우에는 종료일로부터 5일 이내에, 개인정보의 처리 목적 달성, 해당 서비스의 폐지, 사업의 종료 등 그 개인정보가 불필요하게 되었을 때에는 개인정보의 처리가 불필요한 것으로 인정되는 날로부터 5일 이내에 그 개인정보를 파기합니다.
</p>

<h3>개인정보의 안전성 확보 조치</h3>
<p>

올클래스는 개인정보보호법 제29조에 따라 다음과 같이 안전성 확보에 필요한 기술적/관리적 및 물리적 조치를 합니다.

(1) 개인정보 취급 직원의 최소화 및 교육: 개인정보를 취급하는 직원을 지정하고 담당자에 한정시켜 최소화하여 개인정보를 관리하는 대책을 시행합니다.

(2) 내부관리계획의 수립 및 시행: 개인정보의 안전한 처리를 위하여 내부관리계획을 수립하고 시행합니다.

(3) 해킹 등에 대비한 기술적 대책: 해킹이나 컴퓨터 바이러스 등에 의한 개인정보 유출 및 훼손을 막기 위하여 보안프로그램을 설치하고 주기적으로 갱신•점검합니다.

(4) 개인정보에 대한 접근 제한: 개인정보를 처리하는 데이터베이스시스템에 대한 접근권한의 부여, 변경, 말소를 통하여 개인정보에 대한 접근통제를 위하여 필요한 조치를 합니다.
</p>

<h3>개인정보 처리방침 변경</h3>
<p>
이 개인정보처리방침은 시행일로부터 적용되며, 법령 및 방침에 따른 변경내용의 추가, 삭제 및 정정이 있는 경우에는 변경사항의 시행 7일 전부터 공지사항을 통하여 고지할 것입니다.
공고 일자: 2023년 2월 10일
시행 일자: 2023년 2월 10일
</p>

        </div>
    )
}